Revit 2018 API
ShapeImporterSourceFormat Enumeration
 An enumerated type listing the possible formats supported by the Shapeimporter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2017
Since: 2017
Syntax
C#
public enum ShapeImporterSourceFormat
Visual Basic
Public Enumeration ShapeImporterSourceFormat
Visual C++
public enum class ShapeImporterSourceFormat
Members
Member name | Description
Auto |  The format of the incoming data will be determined from input file extension.
SAT |  The incoming data is in SAT format (*.sat).
Rhino |  The incoming data is in Rhino format (*.3dm).
InventorPart |  The incoming data is in Inventor-part format (*.ipt).
InventorAssembly |  The incoming data is in Inventor-assembly format (*.iam).
See Also
Autodesk.Revit.DB Namespace